// Напишите программу, которая на вход принимает на вход число и проверяет,
// кратно ли оно одновременно 7 и 23

int num = 489;

if (num % 7 == 0 && num % 23 == 0){
    Console.WriteLine("да");
}
else{
    Console.WriteLine("нет");
}


